Same issue for me when attempting to create a single node cluster

```
# aws_msk_cluster.cicerone will be created
+ resource "aws_msk_cluster" "cicerone" {
    + arn                      = (known after apply)
    + bootstrap_brokers        = (known after apply)
    + bootstrap_brokers_tls    = (known after apply)
    + cluster_name             = "example"
    + current_version          = (known after apply)
    + enhanced_monitoring      = "DEFAULT"
    + id                       = (known after apply)
    + kafka_version            = "1.1.1"
    + number_of_broker_nodes   = 1
    + zookeeper_connect_string = (known after apply)

    + broker_node_group_info {
        + az_distribution = "DEFAULT"
        + client_subnets  = [
            + "subnet-<redacted>",
          ]
        + ebs_volume_size = 10
        + instance_type   = "kafka.m5.large"
        + security_groups = (known after apply)
      }

    + encryption_info {
        + encryption_at_rest_kms_key_arn = (known after apply)

        + encryption_in_transit {
            + client_broker = "TLS_PLAINTEXT"
            + in_cluster    = true
          }
      }
  }
```

seems to work if i change `number_of_broker_nodes` to 3 and add two more subnets in different AZs to the subnet list.

```
# aws_msk_cluster.cicerone will be created
+ resource "aws_msk_cluster" "cicerone" {
    + arn                      = (known after apply)
    + bootstrap_brokers        = (known after apply)
    + bootstrap_brokers_tls    = (known after apply)
    + cluster_name             = "example"
    + current_version          = (known after apply)
    + enhanced_monitoring      = "DEFAULT"
    + id                       = (known after apply)
    + kafka_version            = "1.1.1"
    + number_of_broker_nodes   = 3
    + zookeeper_connect_string = (known after apply)

    + broker_node_group_info {
        + az_distribution = "DEFAULT"
        + client_subnets  = [
            + "subnet-<redacted>",
            + "subnet-<redacted>",
            + "subnet-<redacted>"
          ]
        + ebs_volume_size = 10
        + instance_type   = "kafka.m5.large"
        + security_groups = (known after apply)
      }

    + encryption_info {
        + encryption_at_rest_kms_key_arn = (known after apply)

        + encryption_in_transit {
            + client_broker = "TLS_PLAINTEXT"
            + in_cluster    = true
          }
      }
  }
```